import { type Lang } from './ui.constants';

export const aboutSections: Record<Lang, { title: string; texts: string[] }[]> =
  {
    ja: [
      {
        title: '言語',
        texts: [
          '言語を学び始めて15年になります。',
          'その間、中国と台湾、イギリスとオーストラリアで生活しながら、仕事をしてきました。',
          '言語を学ぶことで、それぞれの国の文化を知り、いろいろな人と出会うことができました。',
          'その経験から、言語を学ぶことが好きになり、もっといろいろな「言語」を学びたいと思うようになりました。',
        ],
      },
      {
        title: 'プログラミングとの出会い',
        texts: [
          'その中で、プログラミングという新しい「言語」にも興味を持ち、開発の勉強を始めました。',
          '開発の勉強を始めてから、三つのチームプロジェクトを経験しました。',
          'その経験を通して、プログラミングも、人と人、人と世界をつなぎ、生活をもっと便利にするものだと感じました。',
        ],
      },
      {
        title: '目標',
        texts: [
          'これからも、プログラミングという「言語」を通して、人や世界を「つなぐ」エンジニアになりたいです。',
        ],
      },
    ],
    ko: [
      {
        title: '언어',
        texts: [
          '언어를 배우기 시작한 지 15년이 되었습니다.',
          '그동안 중국과 대만, 영국과 호주에서 생활하며 일해 왔습니다.',
          '언어를 배우면서 각 나라의 문화를 알게 되었고, 다양한 사람들을 만날 수 있었습니다.',
          '그 경험을 통해 언어를 배우는 것을 좋아하게 되었고, 더 다양한 **언어**를 배우고 싶다는 생각을 갖게 되었습니다.',
        ],
      },
      {
        title: '프로그래밍과의 만남',
        texts: [
          '그러던 중 프로그래밍이라는 새로운 **언어**에도 관심을 갖게 되어, 개발 공부를 시작했습니다.',
          '개발 공부를 시작한 후, 세 번의 팀 프로젝트를 경험했습니다.',
          '그 경험을 통해 프로그래밍 역시 사람과 사람, 사람과 세상을 잇고 생활을 더 편리하게 만드는 것이라고 느꼈습니다.',
        ],
      },
      {
        title: '목표',
        texts: [
          '앞으로도 프로그래밍이라는 **언어**를 통해 사람과 세상을 잇는 엔지니어가 되고 싶습니다.',
        ],
      },
    ],
  };
